app/controllers/leagues_controller.rb

  def create
    @league = League.create(params["league"])
---
INSERT INTO `leagues` (`name`, `start_date`, `created_at`, `updated_at`, `manager`, `length`, `status`, `end_date`) VALUES('', NULL, '2010-06-18 20:23:56', '2010-06-18 20:23:56', NULL, '', 'created', NULL)